![](logo.png)

# Day Objectives
## Pandas
- Pandas is a built in library using for data analysis. You'll be using Pandas heavily for data manipulation, visualisation, building machine learning models, etc.
- Pandas implements a number of powerful data operations familiar to users of both database frameworks and spreadsheet programs.
- There are two main data structures in Pandas - Series and Dataframes. The default way to store data is dataframes, and thus manipulating dataframes quickly is probably the most important skill set for data analysis.
- Source: https://pandas.pydata.org/pandas-docs/stable/overview.html
## Pandas Series
- A series is similar to a 1-D numpy array, and contains values of the same type (numeric, character, datetime  etc.). A dataframe is simply a table where each column is a pandas series.

## creating series
- List
- Tuple
- Dictionary
- Numpy
- Date_Range
- Series Indexing

## Data Analysis with Pandas


|S.No |Name |Gender|
|--|--|--|
|1 | Mercy | Female|
|2 | Cherry | Male |
|3 | Raju | Male |


* Pandas DataFrame
* Combining & Merging
* File I/O
* Indexing
* sorting
* Filtering

In [1]:
pip install pandas

Requirement already satisfied: pandas in c:\users\lavan\anaconda3\lib\site-packages (1.0.5)Note: you may need to restart the kernel to use updated packages.
Requirement already satisfied: python-dateutil>=2.6.1 in c:\users\lavan\anaconda3\lib\site-packages (from pandas) (2.8.1)
Requirement already satisfied: pytz>=2017.2 in c:\users\lavan\anaconda3\lib\site-packages (from pandas) (2020.1)
Requirement already satisfied: numpy>=1.13.3 in c:\users\lavan\anaconda3\lib\site-packages (from pandas) (1.18.5)
Requirement already satisfied: six>=1.5 in c:\users\lavan\anaconda3\lib\site-packages (from python-dateutil>=2.6.1->pandas) (1.15.0)

In [3]:
import pandas  as pd

In [4]:
pd.__version__

'1.0.5'

## creating series

In [5]:
# convert list into pandas series
li = [213,345,456,6,776,4564,534345]
s1 = pd.Series(li)
s1
# each value in series having index 
# index starts from 0 to n

0       213
1       345
2       456
3         6
4       776
5      4564
6    534345
dtype: int64

In [6]:
# convertig tuple into series
t = (123,34,345.45,"APSSDC")
s2 = pd.Series(t)
s2

0       123
1        34
2    345.45
3    APSSDC
dtype: object

In [7]:
# converting Dict into Series
di = {"a":112,"b":345,"c":68}
s3 = pd.Series(di)
s3
# keys acts like index

a    112
b    345
c     68
dtype: int64

In [10]:
# changing index values
l = [3234,456,34.8]
s4 = pd.Series(l,index = ["x",456,45.4])
s4
# index values can be any type of data

x       3234.0
456      456.0
45.4      34.8
dtype: float64

In [11]:
# converting numpy into series
import numpy as np
n = np.array(l)
s5 = pd.Series(n)
s5

0    3234.0
1     456.0
2      34.8
dtype: float64

In [12]:
# Date_Range

s6 = pd.date_range(start = "2021-06-01",end = "2021-07-15")
s6

DatetimeIndex(['2021-06-01', '2021-06-02', '2021-06-03', '2021-06-04',
               '2021-06-05', '2021-06-06', '2021-06-07', '2021-06-08',
               '2021-06-09', '2021-06-10', '2021-06-11', '2021-06-12',
               '2021-06-13', '2021-06-14', '2021-06-15', '2021-06-16',
               '2021-06-17', '2021-06-18', '2021-06-19', '2021-06-20',
               '2021-06-21', '2021-06-22', '2021-06-23', '2021-06-24',
               '2021-06-25', '2021-06-26', '2021-06-27', '2021-06-28',
               '2021-06-29', '2021-06-30', '2021-07-01', '2021-07-02',
               '2021-07-03', '2021-07-04', '2021-07-05', '2021-07-06',
               '2021-07-07', '2021-07-08', '2021-07-09', '2021-07-10',
               '2021-07-11', '2021-07-12', '2021-07-13', '2021-07-14',
               '2021-07-15'],
              dtype='datetime64[ns]', freq='D')

In [14]:
help(pd.date_range)

Help on function date_range in module pandas.core.indexes.datetimes:

date_range(start=None, end=None, periods=None, freq=None, tz=None, normalize=False, name=None, closed=None, **kwargs) -> pandas.core.indexes.datetimes.DatetimeIndex
    Return a fixed frequency DatetimeIndex.

    Parameters
    ----------
    start : str or datetime-like, optional
        Left bound for generating dates.
    end : str or datetime-like, optional
        Right bound for generating dates.
    periods : int, optional
        Number of periods to generate.
    freq : str or DateOffset, default 'D'
        Frequency strings can have multiples, e.g. '5H'. See
        :ref:`here <timeseries.offset_aliases>` for a list of
        frequency aliases.
    tz : str or tzinfo, optional
        Time zone name for returning localized DatetimeIndex, for example
        'Asia/Hong_Kong'. By default, the resulting DatetimeIndex is
        timezone-naive.
    normalize : bool, default False
        Normalize start/end dates to midnight before generating date range.
    name : str, default None
        Name of the resulting DatetimeIndex.
    closed : {None, 'left', 'right'}, optional
        Make the interval closed with respect to the given frequency to
        the 'left', 'right', or both sides (None, the default).
    **kwargs
        For compatibility. Has no effect on the result.

    Returns
    -------
    rng : DatetimeIndex

    See Also
    --------
    DatetimeIndex : An immutable container for datetimes.
    timedelta_range : Return a fixed frequency TimedeltaIndex.
    period_range : Return a fixed frequency PeriodIndex.
    interval_range : Return a fixed frequency IntervalIndex.

    Notes
    -----
    Of the four parameters ``start``, ``end``, ``periods``, and ``freq``,
    exactly three must be specified. If ``freq`` is omitted, the resulting
    ``DatetimeIndex`` will have ``periods`` linearly spaced elements between
    ``start`` and ``end`` (closed on both sides).

    To learn more about the frequency strings, please see `this link
    <https://pandas.pydata.org/pandas-docs/stable/user_guide/timeseries.html#offset-aliases>`__.

    Examples
    --------
    **Specifying the values**

    The next four examples generate the same `DatetimeIndex`, but vary
    the combination of `start`, `end` and `periods`.

    Specify `start` and `end`, with the default daily frequency.

    >>> pd.date_range(start='1/1/2018', end='1/08/2018')
    DatetimeIndex(['2018-01-01', '2018-01-02', '2018-01-03', '2018-01-04',
                   '2018-01-05', '2018-01-06', '2018-01-07', '2018-01-08'],
                  dtype='datetime64[ns]', freq='D')

    Specify `start` and `periods`, the number of periods (days).

    >>> pd.date_range(start='1/1/2018', periods=8)
    DatetimeIndex(['2018-01-01', '2018-01-02', '2018-01-03', '2018-01-04',
                   '2018-01-05', '2018-01-06', '2018-01-07', '2018-01-08'],
                  dtype='datetime64[ns]', freq='D')

    Specify `end` and `periods`, the number of periods (days).

    >>> pd.date_range(end='1/1/2018', periods=8)
    DatetimeIndex(['2017-12-25', '2017-12-26', '2017-12-27', '2017-12-28',
                   '2017-12-29', '2017-12-30', '2017-12-31', '2018-01-01'],
                  dtype='datetime64[ns]', freq='D')

    Specify `start`, `end`, and `periods`; the frequency is generated
    automatically (linearly spaced).

    >>> pd.date_range(start='2018-04-24', end='2018-04-27', periods=3)
    DatetimeIndex(['2018-04-24 00:00:00', '2018-04-25 12:00:00',
                   '2018-04-27 00:00:00'],
                  dtype='datetime64[ns]', freq=None)

    **Other Parameters**

    Changed the `freq` (frequency) to ``'M'`` (month end frequency).

    >>> pd.date_range(start='1/1/2018', periods=5, freq='M')
    DatetimeIndex(['2018-01-31', '2018-02-28', '2018-03-31', '2018-04-30',
                   '2018-05-31'],
                  dtype='datetime64[ns]', freq='M')

    Multiples are allowed

    >>> pd.date_range(start='1/1/2018', periods=5, freq='3M')
    DatetimeIndex(['2018-01-31', '2018-04-30', '2018-07-31', '2018-10-31',
                   '2019-01-31'],
                  dtype='datetime64[ns]', freq='3M')

    `freq` can also be specified as an Offset object.

    >>> pd.date_range(start='1/1/2018', periods=5, freq=pd.offsets.MonthEnd(3))
    DatetimeIndex(['2018-01-31', '2018-04-30', '2018-07-31', '2018-10-31',
                   '2019-01-31'],
                  dtype='datetime64[ns]', freq='3M')

    Specify `tz` to set the timezone.

    >>> pd.date_range(start='1/1/2018', periods=5, tz='Asia/Tokyo')
    DatetimeIndex(['2018-01-01 00:00:00+09:00', '2018-01-02 00:00:00+09:00',
                   '2018-01-03 00:00:00+09:00', '2018-01-04 00:00:00+09:00',
                   '2018-01-05 00:00:00+09:00'],
                  dtype='datetime64[ns, Asia/Tokyo]', freq='D')

    `closed` controls whether to include `start` and `end` that are on the
    boundary. The default includes boundary points on either end.

    >>> pd.date_range(start='2017-01-01', end='2017-01-04', closed=None)
    DatetimeIndex(['2017-01-01', '2017-01-02', '2017-01-03', '2017-01-04'],
                  dtype='datetime64[ns]', freq='D')

    Use ``closed='left'`` to exclude `end` if it falls on the boundary.

    >>> pd.date_range(start='2017-01-01', end='2017-01-04', closed='left')
    DatetimeIndex(['2017-01-01', '2017-01-02', '2017-01-03'],
                  dtype='datetime64[ns]', freq='D')

    Use ``closed='right'`` to exclude `start` if it falls on the boundary.

    >>> pd.date_range(start='2017-01-01', end='2017-01-04', closed='right')
    DatetimeIndex(['2017-01-02', '2017-01-03', '2017-01-04'],
                  dtype='datetime64[ns]', freq='D')

# Pandas Series Indexing

In [17]:
s1[0]

213

In [22]:
s1[::-1] # reverse of the series

6    534345
5      4564
4       776
3         6
2       456
1       345
0       213
dtype: int64

In [24]:
s1[::2]

0       213
2       456
4       776
6    534345
dtype: int64

In [25]:
s2[1::2]

1        34
3    APSSDC
dtype: object

In [26]:
s1

0       213
1       345
2       456
3         6
4       776
5      4564
6    534345
dtype: int64

In [27]:
s1[3:]

3         6
4       776
5      4564
6    534345
dtype: int64

In [28]:
# access 3,6,2,4
# Fancy Indexing
s1[[3,6,2,4]]
# accessing Specified data

3         6
6    534345
2       456
4       776
dtype: int64

In [29]:
s3

a    112
b    345
c     68
dtype: int64

In [30]:
s3["a"] # explicit slicing

112

In [31]:
s3["c"]

68

In [32]:
s3[0]  # implicit slicing

112

In [34]:
# converting Dict into Series
di = {"a":112,"b":345,"d":np.nan,"c":68}
s7 = pd.Series(di)
s7
# NaN - not a number - a special type of float value

a    112.0
b    345.0
d      NaN
c     68.0
dtype: float64

In [35]:
s8 = pd.Series(di,index = ["a","d","c"])
s8

a    112.0
d      NaN
c     68.0
dtype: float64

In [36]:
s9 = pd.Series("SRM",index = [290,392,435,234,324])
s9

290    SRM
392    SRM
435    SRM
234    SRM
324    SRM
dtype: object

# Task
- Generate n - Table  using pandas series

1 -- 5

2 -- 10

3 -- 15

In [37]:
n = int(input())
ls = [i for i in range(n, (n*10)+1, n)]
s = pd.Series(ls, index=[i for i in range(1, 11)])
print(s)

5
1      5
2     10
3     15
4     20
5     25
6     30
7     35
8     40
9     45
10    50
dtype: int64

In [38]:
di = {1:5,2:10,3:15}
s7 = pd.Series(di)
s7
# here boundaaries fixed and table number also fixed

1     5
2    10
3    15
dtype: int64

In [39]:
list1=[x*5 for x in range(1,11)]
s1=pd.Series(list1,index=np.arange(1,11))
s1

1      5
2     10
3     15
4     20
5     25
6     30
7     35
8     40
9     45
10    50
dtype: int64

In [41]:
li = [5, 10, 15]
s = pd.Series(li, index=(1,2,3))
s

1     5
2    10
3    15
dtype: int64

In [45]:
pd.Series(np.arange(1,11)*5,index = np.arange(1,11))

1      5
2     10
3     15
4     20
5     25
6     30
7     35
8     40
9     45
10    50
dtype: int32

In [48]:
s5 ={1:5,2:10,3:15}
b7 = pd.Series(s5)
b7

1     5
2    10
3    15
dtype: int64

# Pandas DataFrame

In [46]:
# converting dict into Dataframe
di

{1: 5, 2: 10, 3: 15}

In [51]:
df1 = pd.DataFrame(di, index = ["a","b","c"])
df1
# keys acts like column names

   1   2   3
a  5  10  15
b  5  10  15
c  5  10  15

In [53]:
df1.columns = ["X","Y","Z"]
df1

   X   Y   Z
a  5  10  15
b  5  10  15
c  5  10  15

In [54]:
df1.shape # (rows,columns)

(3, 3)

In [56]:
# converting list into Df
df2 = pd.DataFrame([[1,2,3],[3,4,5],[6,7,8]])
df2
# columns and rows starts from 0

   0  1  2
0  1  2  3
1  3  4  5
2  6  7  8

In [57]:
df2.columns = ["er","56","df"]
df2

   er  56  df
0   1   2   3
1   3   4   5
2   6   7   8

In [58]:
df2.index = ["e","t","w"]
df2

   er  56  df
e   1   2   3
t   3   4   5
w   6   7   8

In [61]:
d2 = {
    "Name":["HemaSundar","Manish","Vamsi"],
    "Gender":["Male","Male",np.nan],
    "PIN" : [481,512,345]
}
df3 = pd.DataFrame(d2)
df3

         Name Gender  PIN
0  HemaSundar   Male  481
1      Manish   Male  512
2       Vamsi    NaN  345

In [63]:
type(df3["Name"])

pandas.core.series.Series

In [64]:
df3["Name"]

0    HemaSundar
1        Manish
2         Vamsi
Name: Name, dtype: object

In [65]:
df3["PIN"]

0    481
1    512
2    345
Name: PIN, dtype: int64

In [66]:
df3["Name","PIN"]

KeyError: ('Name', 'PIN')

In [67]:
df3[["Name","PIN"]] # accessing sub df

         Name  PIN
0  HemaSundar  481
1      Manish  512
2       Vamsi  345

In [69]:
df3[2:3]

    Name Gender  PIN
2  Vamsi    NaN  345

In [71]:
df3[::-1]

         Name Gender  PIN
2       Vamsi    NaN  345
1      Manish   Male  512
0  HemaSundar   Male  481

In [72]:
df3["Name"]

0    HemaSundar
1        Manish
2         Vamsi
Name: Name, dtype: object

In [74]:
df3[:1]

         Name Gender  PIN
0  HemaSundar   Male  481

In [77]:
df3.set_index("Name")

           Gender  PIN
Name
HemaSundar   Male  481
Manish       Male  512
Vamsi         NaN  345

In [78]:
df3

         Name Gender  PIN
0  HemaSundar   Male  481
1      Manish   Male  512
2       Vamsi    NaN  345

In [79]:
df3.set_index("Name", inplace = True) # changing original df

In [80]:
df3

           Gender  PIN
Name
HemaSundar   Male  481
Manish       Male  512
Vamsi         NaN  345

## iloc -- for accessing rows using integer indicies
## loc -- for accessing rows other than integer indicies

In [83]:
df3.iloc[0]

Gender    Male
PIN        481
Name: HemaSundar, dtype: object

In [84]:
df3[0]

KeyError: 0

In [86]:
df3.iloc[2]

Gender    NaN
PIN       345
Name: Vamsi, dtype: object

In [89]:
df3.loc["HemaSundar"]

Gender    Male
PIN        481
Name: HemaSundar, dtype: object

In [92]:
df3.loc[["Manish","Vamsi"]]

       Gender  PIN
Name
Manish   Male  512
Vamsi     NaN  345

In [94]:
df3.loc[["Manish","Vamsi"], "PIN"]

Name
Manish    512
Vamsi     345
Name: PIN, dtype: int64

In [97]:
df3.reset_index(inplace = True)

In [98]:
df3

         Name Gender  PIN
0  HemaSundar   Male  481
1      Manish   Male  512
2       Vamsi    NaN  345

# File Reading

In [99]:
df4 = pd.read_csv("https://raw.githubusercontent.com/AP-Skill-Development-Corporation/DataScienceUsingPython-Internship-SRM-University/main/Day12_Pandas/iris.csv")
df4

,Unnamed: 0,sepal length (cm),sepal width (cm),petal length (cm),petal width (cm),Target
0,0,5.1,3.5,1.4,0.2,0
1,1,4.9,3.0,1.4,0.2,0
2,2,4.7,3.2,1.3,0.2,0
3,3,4.6,3.1,1.5,0.2,0
4,4,5.0,3.6,1.4,0.2,0
...,...,...,...,...,...,...
145,145,6.7,3.0,5.2,2.3,2
146,146,6.3,2.5,5.0,1.9,2
147,147,6.5,3.0,5.2,2.0,2
148,148,6.2,3.4,5.4,2.3,2
149,149,5.9,3.0,5.1,1.8,2

In [100]:
df4 = pd.read_csv("iris.csv")
df4

,Unnamed: 0,sepal length (cm),sepal width (cm),petal length (cm),petal width (cm),Target
0,0,5.1,3.5,1.4,0.2,0
1,1,4.9,3.0,1.4,0.2,0
2,2,4.7,3.2,1.3,0.2,0
3,3,4.6,3.1,1.5,0.2,0
4,4,5.0,3.6,1.4,0.2,0
...,...,...,...,...,...,...
145,145,6.7,3.0,5.2,2.3,2
146,146,6.3,2.5,5.0,1.9,2
147,147,6.5,3.0,5.2,2.0,2
148,148,6.2,3.4,5.4,2.3,2
149,149,5.9,3.0,5.1,1.8,2

In [101]:
df5 = pd.read_excel("2020-07-25.xlsx")

In [102]:
df5

    Unnamed: 0 Roll Number 2020-07-25
0            0  17B81A04H1          P
1            1  198A5F0019          P
2            2  17KD1A0560          P
3            3  17KH1A0455          P
4            4  1210316262          P
5            5  18P31A0555          P
6            6  18B01A0211          P
7            7    Y18IT048          P
8            8  17B81A05B2          P
9            9  169X1A04E0          P
10          10  14F41A0447          P
11          11  17W51D5505          P
12          12  18021D0501          P
13          13    Y18CS034          P
14          14    Y18IT040          P
15          15  154M1A0554          P
16          16  19025A0433          P
17          17   180030816          P
18          18  18A31A1248          P
19          19    Y18IT020          P
20          20  18AT1A0527          P
21          21  18121A02D0          P
22          22    Y18IT055          P
23          23  17NE1A0578          P
24          24    Y17CS108          P
25          25    Y18IT063          P
26          26    Y18IT043          P
27          27  178B1A0561          P
28          28  19A95F0019          P
29          29   180050012          P
30          30  166N1A0546          P
31          31   170040246          P
32          32  188W1A0460          P
33          33  14B21A04E1          P
34          34  18AT1A0559          P
35          35     N160868          P
36          36  153B1A0538          P
37          37  17751A0408          P
38          38  18G31A0439          P
39          39   180030523          P
40          40    Y18IT029          P
41          41  18A81A05M5          P
42          42  18A51A1206          P
43          43  18B91A0209          P
44          44  1210416462          P
45          45     R151263          P
46          46     Y18CS80          P
47          47  17F21A0348          P
48          48  10G11A0209          P
49          49  19B95A0512          P
50          50    Y18IT025          P
51          51    Y18IT092          P
52          52    Y18CS166          P
53          53     R141465          P
54          54  17JN1A0495          P
55          55   170031480          P
56          56  2020239167          P

In [104]:
df4.head()

,Unnamed: 0,sepal length (cm),sepal width (cm),petal length (cm),petal width (cm),Target
0,0,5.1,3.5,1.4,0.2,0
1,1,4.9,3.0,1.4,0.2,0
2,2,4.7,3.2,1.3,0.2,0
3,3,4.6,3.1,1.5,0.2,0
4,4,5.0,3.6,1.4,0.2,0

In [105]:
df4.head(2)

,Unnamed: 0,sepal length (cm),sepal width (cm),petal length (cm),petal width (cm),Target
0,0,5.1,3.5,1.4,0.2,0
1,1,4.9,3.0,1.4,0.2,0

In [106]:
df4.tail()

,Unnamed: 0,sepal length (cm),sepal width (cm),petal length (cm),petal width (cm),Target
145,145,6.7,3.0,5.2,2.3,2
146,146,6.3,2.5,5.0,1.9,2
147,147,6.5,3.0,5.2,2.0,2
148,148,6.2,3.4,5.4,2.3,2
149,149,5.9,3.0,5.1,1.8,2

In [107]:
df4.tail(4)

,Unnamed: 0,sepal length (cm),sepal width (cm),petal length (cm),petal width (cm),Target
146,146,6.3,2.5,5.0,1.9,2
147,147,6.5,3.0,5.2,2.0,2
148,148,6.2,3.4,5.4,2.3,2
149,149,5.9,3.0,5.1,1.8,2

In [111]:
df4.sample()

,Unnamed: 0,sepal length (cm),sepal width (cm),petal length (cm),petal width (cm),Target
44,44,5.1,3.8,1.9,0.4,0

In [112]:
df4.iloc[3]

Unnamed: 0           3.0
sepal length (cm)    4.6
sepal width (cm)     3.1
petal length (cm)    1.5
petal width (cm)     0.2
Target               0.0
Name: 3, dtype: float64

In [113]:
df4.iloc[100]

Unnamed: 0           100.0
sepal length (cm)      6.3
sepal width (cm)       3.3
petal length (cm)      6.0
petal width (cm)       2.5
Target                 2.0
Name: 100, dtype: float64

In [115]:
len(df4.columns)

6

In [117]:
df4.shape[0]

150

In [118]:
df4.shape

(150, 6)

In [121]:
df4["sepal length (cm)"] # accessing column as pandas series

0      5.1
1      4.9
2      4.7
3      4.6
4      5.0
      ...
145    6.7
146    6.3
147    6.5
148    6.2
149    5.9
Name: sepal length (cm), Length: 150, dtype: float64

In [123]:
df4[["sepal length (cm)","petal width (cm)"]] # 2 columns as sub df

     sepal length (cm)  petal width (cm)
0                  5.1               0.2
1                  4.9               0.2
2                  4.7               0.2
3                  4.6               0.2
4                  5.0               0.2
..                 ...               ...
145                6.7               2.3
146                6.3               1.9
147                6.5               2.0
148                6.2               2.3
149                5.9               1.8

[150 rows x 2 columns]

In [124]:
df4.describe()

,Unnamed: 0,sepal length (cm),sepal width (cm),petal length (cm),petal width (cm),Target
count,150.000000,150.000000,150.000000,150.000000,150.000000,150.000000
mean,74.500000,5.843333,3.057333,3.758000,1.199333,1.000000
std,43.445368,0.828066,0.435866,1.765298,0.762238,0.819232
min,0.000000,4.300000,2.000000,1.000000,0.100000,0.000000
25%,37.250000,5.100000,2.800000,1.600000,0.300000,0.000000
50%,74.500000,5.800000,3.000000,4.350000,1.300000,1.000000
75%,111.750000,6.400000,3.300000,5.100000,1.800000,2.000000
max,149.000000,7.900000,4.400000,6.900000,2.500000,2.000000

In [125]:
df4.sum()

Unnamed: 0           11175.0
sepal length (cm)      876.5
sepal width (cm)       458.6
petal length (cm)      563.7
petal width (cm)       179.9
Target                 150.0
dtype: float64

In [126]:
df4.count()

Unnamed: 0           150
sepal length (cm)    150
sepal width (cm)     150
petal length (cm)    150
petal width (cm)     150
Target               150
dtype: int64

In [127]:
df4.max()

Unnamed: 0           149.0
sepal length (cm)      7.9
sepal width (cm)       4.4
petal length (cm)      6.9
petal width (cm)       2.5
Target                 2.0
dtype: float64

In [128]:
df4.std()

Unnamed: 0           43.445368
sepal length (cm)     0.828066
sepal width (cm)      0.435866
petal length (cm)     1.765298
petal width (cm)      0.762238
Target                0.819232
dtype: float64

# Sorting

In [129]:
data = pd.read_csv("https://raw.githubusercontent.com/AP-Skill-Development-Corporation/DataScienceUsingPython-Internship-SRM-University/main/Day12_Pandas/Students%20(8).csv")
data

,S.No.,Registration Id,Name,Email,Mobile No
0,1,AP19110010001,Tata Lakshmi Durga Likhitha,tatalikhitha01@gmail.com,7287982736
1,2,AP19110010003,Bhuvana Venigalla,venigallabhuvana@gmail.com,7989023905
2,3,AP19110010005,Kanagala Yoga Sai Abhigna,abhignakanagala21@gmail.com,9390089242
3,4,AP19110010006,Likhitha Parvathi Tadikonda,t.likhithaparvathi@gmail.com,8099140764
4,5,AP19110010007,Jaya Ganesh Kumar Gudipati,jayaganeshkumarg@gmail.com,7330654249
...,...,...,...,...,...
140,141,AP19110020052,Mahesh,mahesh2001.sis@gmail.com,7989651824
141,142,AP19110020077,Saptharishi.D,0123saptha@gmail.com,9000666305
142,143,AP19110020077,Saptharishi Reddy.D,0123saptha@gmail.com,9000666305
143,144,AP19110020106,Karnatapu Sri Sai Dhanush,dhanushkarnatapu1440@gmail.com,9398018626
144,145,AP1911010183,Tiwari Dharmesh Sharma,dharmeshsharma17122002@gmail.com,9704043879

In [136]:
data.sort_index(axis = 0, ascending=True) # axis = 1 columns sort
# axis = 0 index sorting

,S.No.,Registration Id,Name,Email,Mobile No
0,1,AP19110010001,Tata Lakshmi Durga Likhitha,tatalikhitha01@gmail.com,7287982736
1,2,AP19110010003,Bhuvana Venigalla,venigallabhuvana@gmail.com,7989023905
2,3,AP19110010005,Kanagala Yoga Sai Abhigna,abhignakanagala21@gmail.com,9390089242
3,4,AP19110010006,Likhitha Parvathi Tadikonda,t.likhithaparvathi@gmail.com,8099140764
4,5,AP19110010007,Jaya Ganesh Kumar Gudipati,jayaganeshkumarg@gmail.com,7330654249
...,...,...,...,...,...
140,141,AP19110020052,Mahesh,mahesh2001.sis@gmail.com,7989651824
141,142,AP19110020077,Saptharishi.D,0123saptha@gmail.com,9000666305
142,143,AP19110020077,Saptharishi Reddy.D,0123saptha@gmail.com,9000666305
143,144,AP19110020106,Karnatapu Sri Sai Dhanush,dhanushkarnatapu1440@gmail.com,9398018626
144,145,AP1911010183,Tiwari Dharmesh Sharma,dharmeshsharma17122002@gmail.com,9704043879

In [134]:
data.sort_index(axis = 0, ascending=False)

,S.No.,Registration Id,Name,Email,Mobile No
144,145,AP1911010183,Tiwari Dharmesh Sharma,dharmeshsharma17122002@gmail.com,9704043879
143,144,AP19110020106,Karnatapu Sri Sai Dhanush,dhanushkarnatapu1440@gmail.com,9398018626
142,143,AP19110020077,Saptharishi Reddy.D,0123saptha@gmail.com,9000666305
141,142,AP19110020077,Saptharishi.D,0123saptha@gmail.com,9000666305
140,141,AP19110020052,Mahesh,mahesh2001.sis@gmail.com,7989651824
...,...,...,...,...,...
4,5,AP19110010007,Jaya Ganesh Kumar Gudipati,jayaganeshkumarg@gmail.com,7330654249
3,4,AP19110010006,Likhitha Parvathi Tadikonda,t.likhithaparvathi@gmail.com,8099140764
2,3,AP19110010005,Kanagala Yoga Sai Abhigna,abhignakanagala21@gmail.com,9390089242
1,2,AP19110010003,Bhuvana Venigalla,venigallabhuvana@gmail.com,7989023905
0,1,AP19110010001,Tata Lakshmi Durga Likhitha,tatalikhitha01@gmail.com,7287982736

In [137]:
data.sort_index(axis = 1, ascending=False)

,S.No.,Registration Id,Name,Mobile No,Email
0,1,AP19110010001,Tata Lakshmi Durga Likhitha,7287982736,tatalikhitha01@gmail.com
1,2,AP19110010003,Bhuvana Venigalla,7989023905,venigallabhuvana@gmail.com
2,3,AP19110010005,Kanagala Yoga Sai Abhigna,9390089242,abhignakanagala21@gmail.com
3,4,AP19110010006,Likhitha Parvathi Tadikonda,8099140764,t.likhithaparvathi@gmail.com
4,5,AP19110010007,Jaya Ganesh Kumar Gudipati,7330654249,jayaganeshkumarg@gmail.com
...,...,...,...,...,...
140,141,AP19110020052,Mahesh,7989651824,mahesh2001.sis@gmail.com
141,142,AP19110020077,Saptharishi.D,9000666305,0123saptha@gmail.com
142,143,AP19110020077,Saptharishi Reddy.D,9000666305,0123saptha@gmail.com
143,144,AP19110020106,Karnatapu Sri Sai Dhanush,9398018626,dhanushkarnatapu1440@gmail.com
144,145,AP1911010183,Tiwari Dharmesh Sharma,9704043879,dharmeshsharma17122002@gmail.com

In [138]:
data.sort_index(axis = 1, ascending=True)

,Email,Mobile No,Name,Registration Id,S.No.
0,tatalikhitha01@gmail.com,7287982736,Tata Lakshmi Durga Likhitha,AP19110010001,1
1,venigallabhuvana@gmail.com,7989023905,Bhuvana Venigalla,AP19110010003,2
2,abhignakanagala21@gmail.com,9390089242,Kanagala Yoga Sai Abhigna,AP19110010005,3
3,t.likhithaparvathi@gmail.com,8099140764,Likhitha Parvathi Tadikonda,AP19110010006,4
4,jayaganeshkumarg@gmail.com,7330654249,Jaya Ganesh Kumar Gudipati,AP19110010007,5
...,...,...,...,...,...
140,mahesh2001.sis@gmail.com,7989651824,Mahesh,AP19110020052,141
141,0123saptha@gmail.com,9000666305,Saptharishi.D,AP19110020077,142
142,0123saptha@gmail.com,9000666305,Saptharishi Reddy.D,AP19110020077,143
143,dhanushkarnatapu1440@gmail.com,9398018626,Karnatapu Sri Sai Dhanush,AP19110020106,144
144,dharmeshsharma17122002@gmail.com,9704043879,Tiwari Dharmesh Sharma,AP1911010183,145

In [141]:
data.sort_values("Name", ascending=True)

,S.No.,Registration Id,Name,Email,Mobile No
25,26,AP19110010090,Abhinav Challa,abhinavch3011@gmail.com,9182522042
7,8,AP19110010013,Addepalli Srilekha,serevalli12@gmail.com,8688225663
65,66,AP19110010230,Akkineni Sohith Sai,saiakkinenisohith312@gmail.com,7032338671
66,67,AP19110010230,Akkineni Sohith Sai,saiakkinenisohith312@gmail.com,7032338671
40,41,AP19110010131,Anishita Kakani,anishitak@gmail.com,9399939996
...,...,...,...,...,...
35,36,AP19110010118,Vankayalapati Akhil Babu,akhilbabu3838@gmail.com,9121536598
82,83,AP19110010296,Yaminibhargavi Alapati,munnychowdaryalapati@gmail.com,8639173919
83,84,AP19110010296,Yaminibhargavi Alapati,munnychowdaryalapati@gmail.com,8639173919
105,106,AP19110010395,Yelchuri Uma Sankar Phani Kumar Guptha,umasankaryelchuri@gmail.com,9666961872
91,92,AP19110010320,Yogitha Goli,yogithagoli1702@gmail.com,9701802216

In [140]:
data.sort_values("Name",ascending=False)

,S.No.,Registration Id,Name,Email,Mobile No
91,92,AP19110010320,Yogitha Goli,yogithagoli1702@gmail.com,9701802216
105,106,AP19110010395,Yelchuri Uma Sankar Phani Kumar Guptha,umasankaryelchuri@gmail.com,9666961872
82,83,AP19110010296,Yaminibhargavi Alapati,munnychowdaryalapati@gmail.com,8639173919
83,84,AP19110010296,Yaminibhargavi Alapati,munnychowdaryalapati@gmail.com,8639173919
35,36,AP19110010118,Vankayalapati Akhil Babu,akhilbabu3838@gmail.com,9121536598
...,...,...,...,...,...
40,41,AP19110010131,Anishita Kakani,anishitak@gmail.com,9399939996
66,67,AP19110010230,Akkineni Sohith Sai,saiakkinenisohith312@gmail.com,7032338671
65,66,AP19110010230,Akkineni Sohith Sai,saiakkinenisohith312@gmail.com,7032338671
7,8,AP19110010013,Addepalli Srilekha,serevalli12@gmail.com,8688225663
25,26,AP19110010090,Abhinav Challa,abhinavch3011@gmail.com,9182522042

In [143]:
data.sort_values(["Name","Registration Id"], ascending=False)

,S.No.,Registration Id,Name,Email,Mobile No
91,92,AP19110010320,Yogitha Goli,yogithagoli1702@gmail.com,9701802216
105,106,AP19110010395,Yelchuri Uma Sankar Phani Kumar Guptha,umasankaryelchuri@gmail.com,9666961872
82,83,AP19110010296,Yaminibhargavi Alapati,munnychowdaryalapati@gmail.com,8639173919
83,84,AP19110010296,Yaminibhargavi Alapati,munnychowdaryalapati@gmail.com,8639173919
35,36,AP19110010118,Vankayalapati Akhil Babu,akhilbabu3838@gmail.com,9121536598
...,...,...,...,...,...
40,41,AP19110010131,Anishita Kakani,anishitak@gmail.com,9399939996
65,66,AP19110010230,Akkineni Sohith Sai,saiakkinenisohith312@gmail.com,7032338671
66,67,AP19110010230,Akkineni Sohith Sai,saiakkinenisohith312@gmail.com,7032338671
7,8,AP19110010013,Addepalli Srilekha,serevalli12@gmail.com,8688225663
25,26,AP19110010090,Abhinav Challa,abhinavch3011@gmail.com,9182522042

In [144]:
data

,S.No.,Registration Id,Name,Email,Mobile No
0,1,AP19110010001,Tata Lakshmi Durga Likhitha,tatalikhitha01@gmail.com,7287982736
1,2,AP19110010003,Bhuvana Venigalla,venigallabhuvana@gmail.com,7989023905
2,3,AP19110010005,Kanagala Yoga Sai Abhigna,abhignakanagala21@gmail.com,9390089242
3,4,AP19110010006,Likhitha Parvathi Tadikonda,t.likhithaparvathi@gmail.com,8099140764
4,5,AP19110010007,Jaya Ganesh Kumar Gudipati,jayaganeshkumarg@gmail.com,7330654249
...,...,...,...,...,...
140,141,AP19110020052,Mahesh,mahesh2001.sis@gmail.com,7989651824
141,142,AP19110020077,Saptharishi.D,0123saptha@gmail.com,9000666305
142,143,AP19110020077,Saptharishi Reddy.D,0123saptha@gmail.com,9000666305
143,144,AP19110020106,Karnatapu Sri Sai Dhanush,dhanushkarnatapu1440@gmail.com,9398018626
144,145,AP1911010183,Tiwari Dharmesh Sharma,dharmeshsharma17122002@gmail.com,9704043879

In [145]:
data.sort_values(["Name","Registration Id"], ascending=False, inplace = True)
data

,S.No.,Registration Id,Name,Email,Mobile No
91,92,AP19110010320,Yogitha Goli,yogithagoli1702@gmail.com,9701802216
105,106,AP19110010395,Yelchuri Uma Sankar Phani Kumar Guptha,umasankaryelchuri@gmail.com,9666961872
82,83,AP19110010296,Yaminibhargavi Alapati,munnychowdaryalapati@gmail.com,8639173919
83,84,AP19110010296,Yaminibhargavi Alapati,munnychowdaryalapati@gmail.com,8639173919
35,36,AP19110010118,Vankayalapati Akhil Babu,akhilbabu3838@gmail.com,9121536598
...,...,...,...,...,...
40,41,AP19110010131,Anishita Kakani,anishitak@gmail.com,9399939996
65,66,AP19110010230,Akkineni Sohith Sai,saiakkinenisohith312@gmail.com,7032338671
66,67,AP19110010230,Akkineni Sohith Sai,saiakkinenisohith312@gmail.com,7032338671
7,8,AP19110010013,Addepalli Srilekha,serevalli12@gmail.com,8688225663
25,26,AP19110010090,Abhinav Challa,abhinavch3011@gmail.com,9182522042

# Combining or merging

In [150]:
d2 = {
    'Name': ['HemaSundar', 'Manish', 'Vamsi'],
     'Gender': ['Male', 'Male', np.nan],
     'PIN': [481, 512, 345]
     }
df1 = pd.DataFrame(d2)
df1

         Name Gender  PIN
0  HemaSundar   Male  481
1      Manish   Male  512
2       Vamsi    NaN  345

In [159]:
d3 = {
    'Name': ['HemaSundar', 'Manish', 'Vamsi',"lavanya"],
     'PIN': [481, 512, 345,56],
    "Color" : ["White","Black","Yellow","Blue"]
}
df2 = pd.DataFrame(d3)
df2

         Name  PIN   Color
0  HemaSundar  481   White
1      Manish  512   Black
2       Vamsi  345  Yellow
3     lavanya   56    Blue

In [155]:
pd.concat([df1,df2], axis = 0) # concat at below

         Name Gender  PIN   Color
0  HemaSundar   Male  481     NaN
1      Manish   Male  512     NaN
2       Vamsi    NaN  345     NaN
0  HemaSundar    NaN  481   White
1      Manish    NaN  512   Black
2       Vamsi    NaN  345  Yellow

In [154]:
pd.concat([df2,df1], axis = 1) # concat side by side

         Name  PIN   Color        Name Gender  PIN
0  HemaSundar  481   White  HemaSundar   Male  481
1      Manish  512   Black      Manish   Male  512
2       Vamsi  345  Yellow       Vamsi    NaN  345

In [156]:
df1.append(df2) # appended at below

         Name Gender  PIN   Color
0  HemaSundar   Male  481     NaN
1      Manish   Male  512     NaN
2       Vamsi    NaN  345     NaN
0  HemaSundar    NaN  481   White
1      Manish    NaN  512   Black
2       Vamsi    NaN  345  Yellow

In [157]:
df2.append(df1)

         Name  PIN   Color Gender
0  HemaSundar  481   White    NaN
1      Manish  512   Black    NaN
2       Vamsi  345  Yellow    NaN
0  HemaSundar  481     NaN   Male
1      Manish  512     NaN   Male
2       Vamsi  345     NaN    NaN

In [160]:
pd.merge(df1,df2) # one single columns # it retuns only common data rom both dataframes

         Name Gender  PIN   Color
0  HemaSundar   Male  481   White
1      Manish   Male  512   Black
2       Vamsi    NaN  345  Yellow

In [161]:
df1

         Name Gender  PIN
0  HemaSundar   Male  481
1      Manish   Male  512
2       Vamsi    NaN  345

In [162]:
df2

         Name  PIN   Color
0  HemaSundar  481   White
1      Manish  512   Black
2       Vamsi  345  Yellow
3     lavanya   56    Blue

In [164]:
pd.merge(df2,df1, how= "right")

         Name  PIN   Color Gender
0  HemaSundar  481   White   Male
1      Manish  512   Black   Male
2       Vamsi  345  Yellow    NaN

In [165]:
pd.merge(df2,df1, how= "left")

         Name  PIN   Color Gender
0  HemaSundar  481   White   Male
1      Manish  512   Black   Male
2       Vamsi  345  Yellow    NaN
3     lavanya   56    Blue    NaN

In [166]:
pd.merge(df2,df1,how = "outer") # union - all

         Name  PIN   Color Gender
0  HemaSundar  481   White   Male
1      Manish  512   Black   Male
2       Vamsi  345  Yellow    NaN
3     lavanya   56    Blue    NaN

In [168]:
pd.merge(df2,df1,how = "inner")  # intersection - common

         Name  PIN   Color Gender
0  HemaSundar  481   White   Male
1      Manish  512   Black   Male
2       Vamsi  345  Yellow    NaN

In [169]:
help(pd.merge)

Help on function merge in module pandas.core.reshape.merge:

merge(left, right, how: str = 'inner', on=None, left_on=None, right_on=None, left_index: bool = False, right_index: bool = False, sort: bool = False, suffixes=('_x', '_y'), copy: bool = True, indicator: bool = False, validate=None) -> 'DataFrame'
    Merge DataFrame or named Series objects with a database-style join.

    The join is done on columns or indexes. If joining columns on
    columns, the DataFrame indexes *will be ignored*. Otherwise if joining indexes
    on indexes or indexes on a column or columns, the index will be passed on.

    Parameters
    ----------
    left : DataFrame
    right : DataFrame or named Series
        Object to merge with.
    how : {'left', 'right', 'outer', 'inner'}, default 'inner'
        Type of merge to be performed.

        * left: use only keys from left frame, similar to a SQL left outer join;
          preserve key order.
        * right: use only keys from right frame, similar to a SQL right outer join;
          preserve key order.
        * outer: use union of keys from both frames, similar to a SQL full outer
          join; sort keys lexicographically.
        * inner: use intersection of keys from both frames, similar to a SQL inner
          join; preserve the order of the left keys.
    on : label or list
        Column or index level names to join on. These must be found in both
        DataFrames. If `on` is None and not merging on indexes then this defaults
        to the intersection of the columns in both DataFrames.
    left_on : label or list, or array-like
        Column or index level names to join on in the left DataFrame. Can also
        be an array or list of arrays of the length of the left DataFrame.
        These arrays are treated as if they are columns.
    right_on : label or list, or array-like
        Column or index level names to join on in the right DataFrame. Can also
        be an array or list of arrays of the length of the right DataFrame.
        These arrays are treated as if they are columns.
    left_index : bool, default False
        Use the index from the left DataFrame as the join key(s). If it is a
        MultiIndex, the number of keys in the other DataFrame (either the index
        or a number of columns) must match the number of levels.
    right_index : bool, default False
        Use the index from the right DataFrame as the join key. Same caveats as
        left_index.
    sort : bool, default False
        Sort the join keys lexicographically in the result DataFrame. If False,
        the order of the join keys depends on the join type (how keyword).
    suffixes : tuple of (str, str), default ('_x', '_y')
        Suffix to apply to overlapping column names in the left and right
        side, respectively. To raise an exception on overlapping columns use
        (False, False).
    copy : bool, default True
        If False, avoid copy if possible.
    indicator : bool or str, default False
        If True, adds a column to output DataFrame called "_merge" with
        information on the source of each row.
        If string, column with information on source of each row will be added to
        output DataFrame, and column will be named value of string.
        Information column is Categorical-type and takes on a value of "left_only"
        for observations whose merge key only appears in 'left' DataFrame,
        "right_only" for observations whose merge key only appears in 'right'
        DataFrame, and "both" if the observation's merge key is found in both.

    validate : str, optional
        If specified, checks if merge is of specified type.

        * "one_to_one" or "1:1": check if merge keys are unique in both
          left and right datasets.
        * "one_to_many" or "1:m": check if merge keys are unique in left
          dataset.
        * "many_to_one" or "m:1": check if merge keys are unique in right
          dataset.
        * "many_to_many" or "m:m": allowed, but does not result in checks.

        .. versionadded:: 0.21.0

    Returns
    -------
    DataFrame
        A DataFrame of the two merged objects.

    See Also
    --------
    merge_ordered : Merge with optional filling/interpolation.
    merge_asof : Merge on nearest keys.
    DataFrame.join : Similar method using indices.

    Notes
    -----
    Support for specifying index levels as the `on`, `left_on`, and
    `right_on` parameters was added in version 0.23.0
    Support for merging named Series objects was added in version 0.24.0

    Examples
    --------

    >>> df1 = pd.DataFrame({'lkey': ['foo', 'bar', 'baz', 'foo'],
    ...                     'value': [1, 2, 3, 5]})
    >>> df2 = pd.DataFrame({'rkey': ['foo', 'bar', 'baz', 'foo'],
    ...                     'value': [5, 6, 7, 8]})
    >>> df1
        lkey value
    0   foo      1
    1   bar      2
    2   baz      3
    3   foo      5
    >>> df2
        rkey value
    0   foo      5
    1   bar      6
    2   baz      7
    3   foo      8

    Merge df1 and df2 on the lkey and rkey columns. The value columns have
    the default suffixes, _x and _y, appended.

    >>> df1.merge(df2, left_on='lkey', right_on='rkey')
      lkey  value_x rkey  value_y
    0  foo        1  foo        5
    1  foo        1  foo        8
    2  foo        5  foo        5
    3  foo        5  foo        8
    4  bar        2  bar        6
    5  baz        3  baz        7

    Merge DataFrames df1 and df2 with specified left and right suffixes
    appended to any overlapping columns.

    >>> df1.merge(df2, left_on='lkey', right_on='rkey',
    ...           suffixes=('_left', '_right'))
      lkey  value_left rkey  value_right
    0  foo           1  foo            5
    1  foo           1  foo            8
    2  foo           5  foo            5
    3  foo           5  foo            8
    4  bar           2  bar            6
    5  baz           3  baz            7

    Merge DataFrames df1 and df2, but raise an exception if the DataFrames have
    any overlapping columns.

    >>> df1.merge(df2, left_on='lkey', right_on='rkey', suffixes=(False, False))
    Traceback (most recent call last):
    ...
    ValueError: columns overlap but no suffix specified:
        Index(['value'], dtype='object')

# Filtering

In [170]:
data

,S.No.,Registration Id,Name,Email,Mobile No
91,92,AP19110010320,Yogitha Goli,yogithagoli1702@gmail.com,9701802216
105,106,AP19110010395,Yelchuri Uma Sankar Phani Kumar Guptha,umasankaryelchuri@gmail.com,9666961872
82,83,AP19110010296,Yaminibhargavi Alapati,munnychowdaryalapati@gmail.com,8639173919
83,84,AP19110010296,Yaminibhargavi Alapati,munnychowdaryalapati@gmail.com,8639173919
35,36,AP19110010118,Vankayalapati Akhil Babu,akhilbabu3838@gmail.com,9121536598
...,...,...,...,...,...
40,41,AP19110010131,Anishita Kakani,anishitak@gmail.com,9399939996
65,66,AP19110010230,Akkineni Sohith Sai,saiakkinenisohith312@gmail.com,7032338671
66,67,AP19110010230,Akkineni Sohith Sai,saiakkinenisohith312@gmail.com,7032338671
7,8,AP19110010013,Addepalli Srilekha,serevalli12@gmail.com,8688225663
25,26,AP19110010090,Abhinav Challa,abhinavch3011@gmail.com,9182522042

In [171]:
data.iloc[100]

S.No.                                    137
Registration Id                AP19110020035
Name                          Jahnavi Mangam
Email              jahnavimangam17@gmail.com
Mobile No                         9948274445
Name: 136, dtype: object

In [174]:
data[data["S.No."] > 100]           # data Masking

,S.No.,Registration Id,Name,Email,Mobile No
105,106,AP19110010395,Yelchuri Uma Sankar Phani Kumar Guptha,umasankaryelchuri@gmail.com,9666961872
127,128,AP19110010519,V Akhil,akhil0805v@gmail.com,9347657721
144,145,AP1911010183,Tiwari Dharmesh Sharma,dharmeshsharma17122002@gmail.com,9704043879
118,119,AP19110010463,Thatha Naga Jayasree,thathajayasree@gmail.com,9110727521
115,116,AP19110010449,Sumana Bandarupalli,sumanabandarupalli@gmail.com,8074434915
116,117,AP19110010449,Sumana Bandarupalli,sumanabandarupalli@gmail.com,8074434915
113,114,AP19110010431,Satya Mani Syam. D,syamdontula99@gmail.com,9133626880
141,142,AP19110020077,Saptharishi.D,0123saptha@gmail.com,9000666305
142,143,AP19110020077,Saptharishi Reddy.D,0123saptha@gmail.com,9000666305
133,134,AP19110010543,Sai Keerthi,kittu601399@gmail.com,8500074169
124,125,AP19110010510,Rishitha Reddy Maryada,rishithareddymaryada@gmail.com,9059728048
114,115,AP19110010441,Rishitha Chilukuri,chilukuririshithareddy123@gmail.com,9398735959
122,123,AP19110010500,Relangi Babi Vamsi Krishna,krishna.relangi3672@gmail.com,9704863652
137,138,AP19110020036,Pavan Mohan Neelamraju,npavanmohan3@gmail.com,9603853877
134,135,AP19110010549,P.Ruthikvenkat,ruthikpavanagundla@gmail.com,8599901333
117,118,AP19110010459,P. Dheeraj,ram.dheer.ds.5@gmail.com,8688288702
130,131,AP19110010523,Oruganti Aravind,oravindchow@gmail.com,8688216404
132,133,AP19110010542,Nitesh Kumar,bittusoni753378446@gmail.com,9113432950
112,113,AP19110010430,Mothukuri Noushika,noushika15@gmail.com,9533234666
129,130,AP19110010521,Manish Guduri,gudurimanish@gmail.com,8247621148
100,101,AP19110010382,Manasa Nunna,lakshmimanasa1512@gmail.com,9441271128
138,139,AP19110020041,Manam Keerthi Pavan Kumar,pavankumarmanam846@gmail.com,8639015559
139,140,AP19110020041,Manam Keerthi Pavan Kumar,pavankumarmanam846@gmail.com,8639015559
102,103,AP19110010388,Mahesh Valavala,maheshvalavala0388@gmail.com,9963039933
140,141,AP19110020052,Mahesh,mahesh2001.sis@gmail.com,7989651824
135,136,AP19110010553,Mahalakshmi Damarla,mahalakshmidamarla6@gmail.com,7901097444
106,107,AP19110010399,Kotapati Shyam Sundar,shyamsundarkotapati@gmail.com,8688733035
108,109,AP19110010414,Kondaveeti Anugna Sai,anugna99sai567@gmail.com,8179327875
104,105,AP19110010392,Koliparthi Durgavamsi,durga.vamsi.co@gmail.com,9014235991
110,111,AP19110010425,Katakam Akshay Reddy,akshayreddykatakam@gmail.com,7569891759
143,144,AP19110020106,Karnatapu Sri Sai Dhanush,dhanushkarnatapu1440@gmail.com,9398018626
126,127,AP19110010515,Jaya Harshith Ambati,jayaharshith7@gmail.com,9182211321
136,137,AP19110020035,Jahnavi Mangam,jahnavimangam17@gmail.com,9948274445
103,104,AP19110010390,J.Manoj Mahanandi,manojmahanandi2@gmail.com,8688700904
125,126,AP19110010511,Ishita Agrawal,ishitaagrawal909@gmail.com,7489480680
131,132,AP19110010534,Greeshma Kommineni,kgreeshma2002@gmail.com,9494122412
109,110,AP19110010421,Godavarthi Venkata Narasamma,venky.chinna2312@gmail.com,8688532726
120,121,AP19110010481,E Hemasundar Yadav,eddalahemasundar32@gmail.com,9618456239
111,112,AP19110010428,Dandibhotla Bala Pranav,balapranav777@gmail.com,8688879473
101,102,AP19110010386,Damarla Ramadevi,drd9869@gmail.com,9493451234
119,120,AP19110010470,D.Lavanya Sujana,lavanyasujanadamera@gmail.com,9948153456
123,124,AP19110010504,D Tarun Venkat Sai,tarundamarla9@gmail.com,7997703595
107,108,AP19110010402,Chandanam Tanmayee,tanmayechandana@gmail.com,9985891293
128,129,AP19110010520,Chandaluri Snigdha Setty,snigdharupesh16@gmail.com,9754756789
121,122,AP19110010495,Batchu Raja Nithin,nitinbatchu15@gmail.com,8008867604

In [175]:
data[data["Mobile No"] > 9000000000]

,S.No.,Registration Id,Name,Email,Mobile No
91,92,AP19110010320,Yogitha Goli,yogithagoli1702@gmail.com,9701802216
105,106,AP19110010395,Yelchuri Uma Sankar Phani Kumar Guptha,umasankaryelchuri@gmail.com,9666961872
35,36,AP19110010118,Vankayalapati Akhil Babu,akhilbabu3838@gmail.com,9121536598
6,7,AP19110010011,V Naga Sai Aditya Gandavarapu,adityagandavarapu66@gmail.com,9110333929
127,128,AP19110010519,V Akhil,akhil0805v@gmail.com,9347657721
...,...,...,...,...,...
51,52,AP19110010174,Boyapati Sai Venkat,svboyapati24@gmail.com,9182708804
9,10,AP19110010015,Boorlagadda Sai Subhang,subhang51011@gmail.com,9014273040
34,35,AP19110010116,Bharath Kumar Reddy Sanikommu,bharathsanikommu@gmail.com,9110722944
40,41,AP19110010131,Anishita Kakani,anishitak@gmail.com,9399939996
25,26,AP19110010090,Abhinav Challa,abhinavch3011@gmail.com,9182522042

In [178]:
# want to access the records having moblie no starts with 9 and 8 
data[data["Mobile No"] > 8000000000]

,S.No.,Registration Id,Name,Email,Mobile No
91,92,AP19110010320,Yogitha Goli,yogithagoli1702@gmail.com,9701802216
105,106,AP19110010395,Yelchuri Uma Sankar Phani Kumar Guptha,umasankaryelchuri@gmail.com,9666961872
82,83,AP19110010296,Yaminibhargavi Alapati,munnychowdaryalapati@gmail.com,8639173919
83,84,AP19110010296,Yaminibhargavi Alapati,munnychowdaryalapati@gmail.com,8639173919
35,36,AP19110010118,Vankayalapati Akhil Babu,akhilbabu3838@gmail.com,9121536598
...,...,...,...,...,...
26,27,AP19110010092,B.C Amulya,chinmayeamulyasai@gmail.com,8099776689
67,68,AP19110010234,Attuluri Prudhvi Raj,prudhviattuluri@gmail.com,8500016935
40,41,AP19110010131,Anishita Kakani,anishitak@gmail.com,9399939996
7,8,AP19110010013,Addepalli Srilekha,serevalli12@gmail.com,8688225663
25,26,AP19110010090,Abhinav Challa,abhinavch3011@gmail.com,9182522042

In [181]:
# access the records having moblie no starts with 7 and 8 
data[7000000000 < data["Mobile No"] < 9000000000]

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

In [180]:
data[data["Mobile No"]>7000000000]
data[data["Mobile No"]<9000000000]

,S.No.,Registration Id,Name,Email,Mobile No
82,83,AP19110010296,Yaminibhargavi Alapati,munnychowdaryalapati@gmail.com,8639173919
83,84,AP19110010296,Yaminibhargavi Alapati,munnychowdaryalapati@gmail.com,8639173919
52,53,AP19110010175,Vangala Bhargava Anirudh,anirudhroy241@gmail.com,8886862576
98,99,AP19110010374,Vaishnavi Datla,vaishnavivarma87@gmail.com,8790988244
58,59,AP19110010212,Tiyyagura Durga Prasad Reddy,tdurgaprasad2002@gmail.com,7981821182
...,...,...,...,...,...
67,68,AP19110010234,Attuluri Prudhvi Raj,prudhviattuluri@gmail.com,8500016935
93,94,AP19110010340,Anjana Nallanagula,anjana.nallanagula@gmail.com,7981935617
65,66,AP19110010230,Akkineni Sohith Sai,saiakkinenisohith312@gmail.com,7032338671
66,67,AP19110010230,Akkineni Sohith Sai,saiakkinenisohith312@gmail.com,7032338671
7,8,AP19110010013,Addepalli Srilekha,serevalli12@gmail.com,8688225663

In [183]:
data[(data["Mobile No"] > 7000000000) & (data["Mobile No"] < 9000000000)]

,S.No.,Registration Id,Name,Email,Mobile No
82,83,AP19110010296,Yaminibhargavi Alapati,munnychowdaryalapati@gmail.com,8639173919
83,84,AP19110010296,Yaminibhargavi Alapati,munnychowdaryalapati@gmail.com,8639173919
52,53,AP19110010175,Vangala Bhargava Anirudh,anirudhroy241@gmail.com,8886862576
98,99,AP19110010374,Vaishnavi Datla,vaishnavivarma87@gmail.com,8790988244
58,59,AP19110010212,Tiyyagura Durga Prasad Reddy,tdurgaprasad2002@gmail.com,7981821182
...,...,...,...,...,...
67,68,AP19110010234,Attuluri Prudhvi Raj,prudhviattuluri@gmail.com,8500016935
93,94,AP19110010340,Anjana Nallanagula,anjana.nallanagula@gmail.com,7981935617
65,66,AP19110010230,Akkineni Sohith Sai,saiakkinenisohith312@gmail.com,7032338671
66,67,AP19110010230,Akkineni Sohith Sai,saiakkinenisohith312@gmail.com,7032338671
7,8,AP19110010013,Addepalli Srilekha,serevalli12@gmail.com,8688225663

In [184]:
data2 = data.copy()
data2['Mobile No'] = data2['Mobile No'].astype(str)
m_num = input("Enter the number, to find the numbers starts with that number: ")
series = data2['Mobile No'].str.startswith(m_num)
data2[series]

Enter the number, to find the numbers starts with that number: 7

,S.No.,Registration Id,Name,Email,Mobile No
58,59,AP19110010212,Tiyyagura Durga Prasad Reddy,tdurgaprasad2002@gmail.com,7981821182
0,1,AP19110010001,Tata Lakshmi Durga Likhitha,tatalikhitha01@gmail.com,7287982736
64,65,AP19110010229,R. Hasitha Sree,rhasithasree123@gmail.com,7337050642
37,38,AP19110010126,R . Uday Kiran,udaykiranramaraju@gmail.com,7780273060
94,95,AP19110010346,Pushpa Latha,pushpalathaavvaru@gmail.com,7995694959
44,45,AP19110010160,Mullapudi Venkat,Venkatmullapudi14300@gmail.com,7032567895
72,73,AP19110010249,Mohit Kumar,mohitkumar.projects@gmail.com,7281809313
140,141,AP19110020052,Mahesh,mahesh2001.sis@gmail.com,7989651824
135,136,AP19110010553,Mahalakshmi Damarla,mahalakshmidamarla6@gmail.com,7901097444
23,24,AP19110010080,M.Tarun,tarunchowdary001@gmail.com,7337433099
33,34,AP19110010112,Lakkireddy Harshitha,harshithalakkireddy@gmail.com,7093566384
86,87,AP19110010308,Kommineni Sahithi,sahithi.kommineni32@gmail.com,7997045446
110,111,AP19110010425,Katakam Akshay Reddy,akshayreddykatakam@gmail.com,7569891759
73,74,AP19110010252,K Sriharsha,bsriharsh48@gmail.com,7075855001
4,5,AP19110010007,Jaya Ganesh Kumar Gudipati,jayaganeshkumarg@gmail.com,7330654249
125,126,AP19110010511,Ishita Agrawal,ishitaagrawal909@gmail.com,7489480680
71,72,AP19110010246,Ghanta Jaiya,ghantajaiya12@gmail.com,7013144227
47,48,AP19110010166,G.B.N.V.S.Abhinav,saiabhinavgarlapati@gmail.com,7207723457
123,124,AP19110010504,D Tarun Venkat Sai,tarundamarla9@gmail.com,7997703595
1,2,AP19110010003,Bhuvana Venigalla,venigallabhuvana@gmail.com,7989023905
93,94,AP19110010340,Anjana Nallanagula,anjana.nallanagula@gmail.com,7981935617
65,66,AP19110010230,Akkineni Sohith Sai,saiakkinenisohith312@gmail.com,7032338671
66,67,AP19110010230,Akkineni Sohith Sai,saiakkinenisohith312@gmail.com,7032338671